#include <iostream> //п≥дключаЇмо б≥бл≥отеки
#include <cmath>

int main()
{
    double x, eps; //довжини стор≥н
    std::cout << "Enter x\n"; //вводимо довжину a
    std::cin >> x;
    std::cout << "Enter eps\n"; //вводимо довжину b
    std::cin >> eps;
    
    int n = 1;
    double y, yn, yn1, zn, zn1, zn2, e;

    zn = sin(x) / (n * n); //шукаЇмо знаменник y(n)  при n=1

    do {
        yn = 1 / zn; // шукаЇмо y(n)
        n = n++; //зб≥льшуЇмо n на 1
        zn2 = sin(x) / (n * n); //шукаЇмо наступний доданок знаменника
        zn1 = zn + zn2; //шукаЇмо знаменник y(n+1)
        yn1 = 1 / zn1; //шукаЇмо y(n+1)
        zn = zn1; //запам'€товуЇмо знаменник y(n+1) €к знаменник y(n)
        e = abs(yn1 - yn); //знаходимо модуль р≥зниц≥ двох останн≥х знайдених y
    } while (e >= eps); //виконуЇмо поки р≥зниц€ двох останн≥х знайдених y не буде меншою за точн≥сть

    y = yn1;
    std::cout << "y = " << (y); //виводимо останнЇ знайдене значенн€ y(n), пораховане з потр≥бною точн≥стю
    return 0;
}