#include <iostream>

/*Нехай a(0) = 1; a(k) = k * a(k - 1) + 1 / k; k = 1, 2, ... 
Для заданого натурального n отримати a(n)*/

/*Оскільки результати обчислень при n>170 виходять за межі допустимих значень для виведення, 
користувачу пропонується ввести натуральне n, що належить проміжку від 1 до 170. 
В іншому випадку буде виведено підказку, що значення n було зазначено неправильно*/

int main()
{
    //оголошуємо змінні
    int n;
    long double a0 = 1;
    long double a1, an;
    // просимо ввести число n у проміжку [1;170] та зчитуємо його
    std::cout << "Enter n (minimum possible value = 1, maximum possible value = 170)" << "\nn = ";
    std::cin >> n;
    //перевіряємо, чи правильно введено число n
    if (n>=1 and n <=170)
    //якщо n задовільняє умову, виконуємо цикл, який розраховує всі значення a від a1 до an
    for (int k = 1; k <= n; k++)
    {
        a1 = k * a0 + 1 / k; //рахуємо кожне наступне a через його попереднє значення
        a0 = a1; //запам'ятовуємо нове значення, як попереднє для розрахунку наступного
        std::cout << "a(" << k << ") = " << a1 << std::endl; //виводимо значення ak
    }
    else std::cout << "Wrong n" << std::endl; //виводимо підказку, якщо значення n не належить потрібному проміжку
}
